{
	"help": {
		"text": "\n使用“\\help 功能名（英文）”以查询对应功能的信息！\n目前已有的功能名有：help（帮助）,echo（复读）,picture（发图）,wwf（狼人杀）\n"
	},
	"echo": {
		"text": "\n使用“\\echo xxx”命令后，小蝎蝎将会复读你说的话！\n"
	},
	"picture": {
		"text": "\n输入“收藏 tag=xxx”后，发出一张图片即可以xxx为tag收藏该图\n输入“发xxx”后，小蝎蝎会一张xxx为tag的随机图片\n回复小蝎蝎发的图片并输入“取消收藏”以从记录中删除该图片（要求是该图的收藏者或管理员）\n使用“rank”以查询今日收藏图排行榜\n使用“ban @一名用户”以禁止其发图\n使用“unban @一名用户”以取消禁止\n（当然以上两条命令要求管理员权限）\n"
	},
	"wwf": {
		"text": "\n使用“\\help wwfrule” 获得狼人杀详细feature与规则\n注意：一切狼人杀命令只能私聊bot发出，群聊无效\n以下命令均以“\\wwf ”开头且用空格严格区分，请注意格式。<>部分为需替换内容，<玩家名>可以是昵称\/qq号\/玩家在游戏中的顺位\n（一个正确的指令例子：“\\wwf witch heal 1”）\n（部分命令有一些特殊规则，详情请见“\\help wwfrule”）\n“join <房间号>”以加入房间，如果没有该房间则创建并成为房主。\n“quit <房间号>”以退出房间，如果游戏正在进行则导致玩家死亡。如果是房主则房主顺位传递。\n“config <xxx>”以调整设置（要求房主），xxx为一串连续不带空格的文本，其中关键词有：\n有警\/无警\/屠边\/屠城\/狼\/民\/女巫\/猎人\/预言家，其中角色名前需要有一个数字来匹配其数量。\n（一个正确的指令例子：“\\wwf config 无警3民狼1预言家1猎人屠城”）\n“state”以获得当前房间信息。\n“nickname <你的昵称>”以修改昵称\n“begin”以开始游戏（要求房主）\n“night”以在投票后遗言发表后进入夜晚（要求房主）\n“tell <common\/werewolf> <xxx>”以公共聊天\/狼人队内聊天，xxx为发送的内容\n“seer <玩家名>”以预言家查验一个人身份\n以下命令可以省略第二个及以后的参数来放弃这次操作机会\n“murder <玩家名>”以狼人杀死一个人\n“witch <kill\/heal> <玩家名>”以女巫救活/杀死一个人\n“hunter <玩家名>”以猎人杀死一个人\n“givesh <玩家名>”以警长传递警徽给一个人\n“vote <玩家名>” 以投票一个玩家\n“votesh <玩家名>”以投票一名玩家成为警长\n“<besheriff\/notsheriff>”以选择是否上警\n"
	},
	"wwfrule": {
		"text": "房间：房间是游戏的基本单位，房间号必须为四位数字且唯一，一个房间可以进行多次游戏，一个房间有一个房主，仅当房间没人时房间被删除。\n玩家：玩家拥有三个标识：QQ号，昵称和编号（房间内按加入顺序从1开始）。优先用昵称表示玩家，默认昵称为 p+QQ号\n昵称：玩家可以任意时刻修改昵称，昵称不能为纯数字（和qq号与编号区分），不能和同房间者相同。\n加入房间：若房间未满则可加入房间，第一位加入房间的人创建房间并成为房主，无法同时加入两个房间。\n退出房间：玩家可在任何时候退出房间，游戏中退出房间者在游戏内视为死亡，任何操作不得以之为目标且跳过其相关阶段（如跳过猎人开枪），游戏结束后退出游戏者才从玩家列表中消失，但这期间该账号视为不在房间内。房主退出后房主传给未退出且编号最小者。\n游戏设置：游戏开始前房主可更改游戏设置，可更改每个角色数量和是否有警长，使用屠边\/屠城规则。最大人数不得小于当前房间人数，游戏配置不得不合理（一方最优策略下必胜），每类神最多有一个，没有村民\/神无法使用屠边规则。\n房间状态：当以上状态变更时，将会将更新后的房间状态广播至所有玩家。\n文字交流：支持发消息并广播给房间内所有玩家，支持公共和狼人两个频道。（允许好人单方面在狼人频道说话）\n游戏角色：游戏支持村民狼人猎人女巫预言家，并支持警长规则，其中猎人女巫预言家统称为神，狼人以外统称为好人。\n游戏开始：房间人满且游戏未开始时房主可开始游戏，开始游戏后每个人将得知自己的身份，狼人将得知队友身份。\n游戏结束：任何死亡结算后，当最优策略下一方游戏必胜时，直接结束游戏，好人胜利条件为杀死所有狼人，狼人胜利条件为杀死所有好人（屠城）或杀死所有村民或所有神（屠边）。游戏结束时宣布所有玩家身份并且房间回归等待状态。\n游戏流程：天黑->狼人杀人->预言家验人->女巫救\/杀人->（如果第一个白天且支持警长规则则选警长）->天亮（宣布死亡名单）->自由交流->投票->被投票者遗言->房主确认进入下一天。\n特殊阶段：当猎人被宣布死亡时，猎人可以开枪打死一个角色。警长被宣布死亡时，警长可以传递警徽（指定一人当警长）。这两个操作均为插入当前阶段中的特殊阶段。\n狼人杀人：该环节狼人可以选择一名存活角色杀死（包括自己），任意一名狼人均可决定，所以在使用对应指令前应当讨论周全。\n预言家验人：预言家可以选取一名存活角色并得知其是好人还是狼人。\n女巫救\/杀人：女巫拥有解药时，可以得知当晚被狼人杀死的玩家。女巫可以选择救该玩家或杀死一名存活玩家。女巫无法救自己（但可以杀自己）。\n警长：警长的在投出玩家的投票中算作1.5票。\n投票：投出玩家的投票中，玩家可以投给任何一名存活玩家，也可以弃票。若平票则进行第二轮投票，第二轮投票无法弃票，若平票则无事发生。票数最高的玩家出局并发表遗言。\n上警：选警长环节分为两个阶段，第一个阶段所有人选择是否上警，选择完后轮流发言并且未上警者选择投票。投票规则同投出玩家的投票。二次平票或者玩家全部上警\/不上警则警徽遗失（没有警长）\n死亡结算：夜晚不进行退出游戏外的死亡结算，而全部累积至天亮时进行。\n报错：除了指令\\wwf xxx的部分打错（无法进入xxx模块），否则均会有提示错误。\n"
	}
}